'''
Провести побитные операции над числами 5 и 6

& (Побитовое И (AND)),
^ (Исключающее ИЛИ (XOR)),
~ (Побитовое отрицание (NOT)),
'''

bit_and = 5 & 6
bit_or = 5 | 6
bit_xor = 5 ^ 6
b = 5
print(f'5 в двоичной системе: {bin(5)}')
print(f'6 в двоичной системе: {bin(6)}')

print(f'Выполним логические побитовые операции над числами 5 и 6:\n'
      f'5 & 6 = 0b111, или {bit_and}\n'
      f'5 | 6 = 0b100, или {bit_or}\n'
      f'5 ^ 6 = 0b011, или {bit_xor}')

print("%d << 2 = %d (%s)" % (b,b<<2,bin(b<<2)))
print("%d >> 2 = %d (%s)" % (b,b>>2,bin(b>>2)))